InformationRegisters/СтоимостьВыработкиПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьВыработкиПроизводства</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляМенеджера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗаПозициюДелитсяНаВсехРаспройщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоВыработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатурыПотолка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтоимостьВыработкиПроизводства/Ext/ManagerModule.bsl
Функция ПолучитьЦенуВыработкиНоменклатуры(Дата, ВидНоменклатурыПотолка, Номенклатура, ЕдиницаИзмерения) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура = &Номенклатура
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьЦенуВыработкиНоменклатурыЗаПозициюМенеджеру(Дата, ВидНоменклатурыПотолка) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.СтоимостьДляМенеджера КАК Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура ЕСТЬ NULL
	|				И ЕдиницаИзмерения ЕСТЬ NULL) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьЦенуВыработкиНоменклатурыЗаПозициюРаскройщику(Дата, ВидНоменклатурыПотолка) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьВыработкиПроизводстваСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьВыработкиПроизводства.СрезПоследних(
	|			&ДатаЗапроса,
	|			ВидНоменклатурыПотолка = &ВидНоменклатурыПотолка
	|				И Номенклатура ЕСТЬ NULL
	|				И ЕдиницаИзмерения ЕСТЬ NULL) КАК СтоимостьВыработкиПроизводстваСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыПотолка",ВидНоменклатурыПотолка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Стоимость;
	КонецЦикла;
	
КонецФункции
